Repository: schmidtevgeny/stellaris_morenames_omega
Catalog: stellaris_morenames-omegat.tmx
Source language: en_us
Languages: ru

source: Kaiser Proposes Closer Economic Cooperation
ru: Кайзер предлагает более тесное экономическое сотрудничество

source: Kaiser Proposes Increased Military Cooperation
ru: Кайзер предлагает расширить военное сотрудничество

source: Kaiser Proposes Military Union
ru: Кайзер предлагает военный союз

source: Kaiser Refuses!
ru: Кайзер отказывается!

source: Kaiser Thrusters
ru: Двигатели Кайзер

source: Kaiser expells us from FTO!
ru: Кайзер изгоняет нас из FTO!

source: Kaiser's Opinion Increases!
ru: Мнение кайзера растет!

source: Kaiserweltraumrakete
ru: Кайзервелтраумракете

source: Kaltenburg Katzstein
ru: Кальтенбург Кацштайн

source: Kamikae
ru: Камикадзе

source: Kapadreus Abyss
ru: Бездна Кападреуса

source: Kaptica Maelstrom
ru: Каптический водоворот

source: Kardashev's
ru: Кардашев

source: Karl
ru: Карл

source: Katdams Singularity
ru: Сингулярность Катдама

source: Katenurias Singularity
ru: Сингулярность Катенурии

source: Katfred
ru: Катфред

source: Katherine
ru: Кэтрин

source: Katienne
ru: Кэти

source: Katlantropa Desertification
ru: Опустынивание Катлантропы

source: Katlantropa Economic Turmoil
ru: Экономические потрясения в Катлантропе

source: Katlantropa Project
ru: Проект Катлантропа

source: Katlinin has united the Katzens under the banner of socialism and egalitarianism, and now seeks to bring the great feline revolution to the entire galaxy.
ru: Катлинин объединил Катзенов под знаменем социализма и эгалитаризма и теперь стремится распространить великую кошачью революцию на всю галактику.

source: Katnippa
ru: Катнипа

source: Katnova Black Hole
ru: Черная дыра сверхновой

source: Katown Megalopolis
ru: Мегаполис Катаун

source: Katown Shield
ru: Щит Катауна

source: Katrias Maw
ru: Катриас Моу

source: Kattail Ad Aeternam
ru: Каттейл до скончания веков

source: Kattarji
ru: Каттарджи

source: Kattarji Holdens
ru: Каттарджи Холденс

source: Kattede Vortex
ru: Вихрь Каттеде

source: Katustos Black Hole
ru: Черная дыра Катустоса

source: Katzen
ru: Катзен

source: Katzen Admirals Defect!
ru: Адмиралы Катзен дезертируют!

source: Katzen Agricultural Crisis
ru: Сельскохозяйственный кризис Катзен

source: Katzen Airforce
ru: Военно-воздушные силы Катцена

source: Katzen Anti-Bombardment Measures
ru: Меры по борьбе с бомбардировками Катзен

source: Katzen Atomic Munitions
ru: Атомные боеприпасы Катзен

source: Katzen Atomics
ru: Катзен Атомикс

source: Katzen Attaché
ru: Атташе Катзен

source: Katzen Capital
ru: Столица Катзен

source: Katzen Celestial Body Weaponization
ru: Вооружение небесного тела Катзен

source: Katzen Colony Revolts!
ru: Колония Катзен восстает!

source: Katzen Conquest
ru: Завоевание Катзен

source: Katzen Defense Array
ru: Оборонительный комплекс Катзен

source: Katzen Defense Arrays
ru: Защитные системы Катзен

source: Katzen Defensive Buff
ru: Защитный бафф Катзен

source: Katzen E.H.V.E.
ru: Катзен Э.Х.В.Е.

source: Katzen E.H.V.Es
ru: Катзен Э.Х.В.Е.

source: Katzen Economic Status
ru: Экономический статус Катзен

source: Katzen Economy Mechanics
ru: Экономическая механика Катзен

source: Katzen Entertainment Complex
ru: Развлекательный комплекс Катзен

source: Katzen Environmental Reshaper
ru: Преобразователь окружающей среды Катзен

source: Katzen Fortress World
ru: Мир крепости Катзен

source: Katzen Foundry World
ru: Мир литейного производства Катзен

source: Katzen Housing Complex
ru: Жилой комплекс Катзен

source: Katzen Housing Complexes
ru: Жилые комплексы Катзен

source: Katzen Imperial Capital
ru: Имперская столица Катзен

source: Katzen Intel Leaked
ru: Утечка информации Катзен

source: Katzen Laboratory World
ru: Лабораторный мир Катзен

source: Katzen Land Trades
ru: Торговля землей Катзен

source: Katzen Megafoundry
ru: Мегафаундри Катзен

source: Katzen Megareactor
ru: Мегареактор Катзен

source: Katzen Megarefineries
ru: Катзен Мегареференции

source: Katzen Navy
ru: Военно-морской флот Катцена

source: Katzen Planetary Administration
ru: Планетарная администрация Катзен

source: Katzen Pretender
ru: Притворщик Катзен

source: Katzen Psionic Avatars
ru: Псионические аватары Катцена

source: Katzen Rebels
ru: Повстанцы Катзен

source: Katzen Research Center
ru: Исследовательский центр Катзен

source: Katzen Research Efforts
ru: Исследовательские усилия Катзен

source: Katzen Rupture
ru: Разрыв Катзен

source: Katzen Ship Purchase
ru: Покупка судна Катзен

source: Katzen Ships Arrive!
ru: Корабли Катзен прибывают!

source: Katzen Soulbot Research Disrupted
ru: Исследование Катзен Соулбота прервано

source: Katzen Splinter State
ru: Расколотое государство Катзен

source: Katzen Splinter States Angered
ru: Отколовшиеся государства Катзен разгневаны

source: Katzen Submarine Snare
ru: Ловушка подводной лодки Катзен

source: Katzen Unterraumboots are blockading FTL communications and transit around this world, drastically disrupting productivity.
ru: Ботинки Катзен Нетерраумботs блокируют сверхсветовую связь и транзит по всему миру, резко снижая производительность.

source: Katzen War Forge
ru: Военная кузница Катзен

source: Katzen War Forge Construction Site
ru: Строительная площадка военной кузницы Катзен

source: Katzen War Forge Demolished!
ru: Военная кузница Катзен разрушена!

source: Katzen War forge Uplink
ru: Восходящая линия военной кузницы Катзен

source: Katzen Weaknesses
ru: Слабые стороны Катзен

source: Katzen Weaknesses Discovered!
ru: Обнаружены слабые места Катзен!

source: Katzen Weakpoint Analysis
ru: Анализ слабых мест Катзен

source: Katzen Wormhole
ru: Червоточина Катзен

source: Katzen-[Root.GetSpeciesName] Peace Treaty
ru: Катзен-[Root.GetSpeciesName] Мирный договор

source: Katzenarmee Colonial Garrison
ru: Колониальный гарнизон Катценарми

source: Katzenarmee Garrison
ru: Гарнизон Катценарми

source: Katzenarmee Peacekeeper Garrison
ru: Гарнизон миротворцев Катценарми

source: Katzenarmee Supply Line Sabotage Failed
ru: Провалился саботаж линии снабжения Катзеринга

source: Katzenarmee Task Force
ru: Оперативная группа Катценарми

source: Katzenarmee Task Force I
ru: Оперативная группа I Катценармии

source: Katzenarmee Task Force II
ru: Оперативная группа Катценарми II

source: Katzenartig Imperium Achieves FTL
ru: Империя Катзеринга достигает сверхсветовой скорости

source: Katzenartig Imperium Balancing
ru: Балансировка империи Катзеринга

source: Katzenartig Imperium Collapses
ru: Империя Катзеринга рушится

source: Katzenartig Imperium Completes E.H.O.F.!
ru: Империя Катзеринга завершает Э.Х.О.Ф.!

source: Katzenartig Imperium Constructing E.H.O.F.!
ru: Империя Катзеринга строит Э.Х.О.Ф.!

source: Katzenartig Imperium Converting E.H.O.F.!
ru: Империя Катзеринга преобразует Э.Х.О.Ф.!

source: Katzenartig Imperium Defeated!
ru: Империя Катзеринга побеждена!

source: Katzenartig Imperium Embarks on Flusion Conquest
ru: Империя Катзеринга отправляется на завоевание Флюсиаллаа

source: Katzenartig Imperium Rebuilding Kaiser Moon!
ru: Империя Катзеринга восстанавливает Луна Кайзера!

source: Katzenartig Imperium goes to war!
ru: Империя Катзеринга вступает в войну!

source: Katzenartig Imperium: Submission
ru: Империя Катзеринга: подчинение

source: Katzenbodentruppen
ru: Катзенбодентруппен

source: Katzenkreuzer
ru: Катзенкройцер

source: Katzenkreuzers
ru: Катзенкройцеры

source: Katzenland Habitability
ru: Обитаемость Катзенланда

source: Katzenland Preference
ru: Предпочтение Катзенланда

source: Katzenland's Last Zuspri
ru: Последняя эзикания Катзенланда

source: Katzenlandian Terraforming Methods
ru: Катзенландские методы терраформирования

source: Katzenmarshall Elwin Reunifies Katzenartig Imperium!
ru: Катзенмаршал Элвин воссоединяет империю Катзенртиг!

source: Katzens Begin Deployment of Unterraumboot Spacecraft
ru: Катзенс начинает развертывание космического корабля Нетерраумбот

source: Katzens Obliterate Corronian Worldcraft
ru: Катзенс уничтожает корронианский Великий сотворитель

source: Katzenschnellegewehr
ru: Катзеншнеллегевер

source: Katzenson
ru: Катценсон

source: Katzenweltraumpanzer
ru: Катзенвельтраумпанцер

source: Katzenweltraumpanzers
ru: Катзенвельтраумпанцеры

source: Katzesir
ru: Кацизир

source: Katzgouverneur
ru: Кацгувернер

source: Katzkonstrukteur
ru: Кацконструктор

source: Katzkonstrukteurs
ru: Кацконструкторы

source: Katzprotekrotat
ru: Кацпротекротат

source: Katzprotektorat
ru: Кацпротекторат

source: Katzven
ru: Кацвен

source: Keep digging!
ru: Продолжайте копать!

source: Keep digging.
ru: Продолжайте копать.

source: Keep monitoring them.
ru: Продолжайте следить за ними

source: Keep on watching.
ru: Продолжайте наблюдать

source: Keep the monster caged, it will make do with what scraps we give it
ru: Держите монстра в клетке, он обойдется теми объедками, которые мы ему дадим

source: Keep your eyes open for opportunities to analyze our opponent.
ru: Держите ухо востро, потому что мы должны проанализировать нашего противника

source: Keeper: Architecture
ru: Архивариус: архитектура

source: Keeper: Astronomy
ru: Архивариус: астрономия

source: Keeper: Chemistry
ru: Архивариус: химия

source: Keeper: Communications
ru: Архивариус: лингвистика и коммуникация

source: Keeper: Cultures
ru: Архивариус: культура

source: Keeper: Electronics
ru: Архивариус: электроника

source: Keeper: Geology
ru: Архивариус: геология

source: Keeper: History
ru: Архивариус: история

source: Keeper: Mathematics
ru: Архивариус: математика

source: Keeper: Mechanics
ru: Архивариус: механика

source: Keeper: Software
ru: Архивариус: программное обеспечение

source: Keeper: Taxonomy
ru: Архивариус: систематика

source: Keeper: War
ru: Архивариус: война

source: Keeping the gravity bore's design focused on mineral extraction will give us a greater flow of raw materials.
ru: Сохранение конструкции гравитационного ствола, ориентированного на добычу полезных ископаемых, обеспечит нам больший поток сырья

source: Keller
ru: Келлер

source: Kerbula Abyss
ru: Бездна Кербулы

source: Kercys Maw
ru: Пасть Керси

source: Kerran Abyss
ru: Керранская бездна

source: Kerria Abyss
ru: Бездна Керрии

source: Kerusium Vortex
ru: Вихрь Керусия

source: Ketiuu Abyss
ru: Бездна Кетиуу

source: Kibbles has united the ruins of the Imperium and reforged them into a stable and democratic republic.
ru: Кибблз объединил руины Империума и перековал их в стабильную и демократическую республику.

source: Kill Domesticated Aliens
ru: Убить одомашненных пришельцев

source: Kill her.
ru: Убей ее.

source: Kindness
ru: Доброжелательность

source: Kinetic
ru: Кинетическое

source: Kirin Army
ru: Армия Кирина

source: Kirkasmajakka
ru: Киркасмаякка

source: Kirkasmajakka disabled
ru: Киркасмаякка отключен

source: Kirkasmajakka will be destroyed
ru: Киркасмаякка будет уничтожена

source: Kitlaz
ru: Китлаз

source: Kitt
ru: Китт

source: Kitti Luft Reunifies Katzenartig Imperium!
ru: Сержант Ти-Ти воссоединяет Империю Катзенртиг!

source: Kittzos Kott
ru: Китцос Котт

source: Klein
ru: Кляйн

source: Klokis Singularity
ru: Сингулярность Клокиса

source: Knocking asteroids into orbit for mining is old-fashion, hollowing them out for use as defense platforms is far more interesting.
ru: Забрасывать астероиды на орбиту для добычи полезных ископаемых — это старомодно. Использование их в качестве оборонительных платформ гораздо интереснее.

source: Know that we aren't afraid of conflict, [ROOT.GetName].
ru: Знайте, что мы не боимся конфликта, [ROOT.GetName]

source: Knowledge Overwhelming
ru: Ошеломляющее знание

source: Knowledge about these archives might help our engineering research.
ru: Знания об этих архивах могут помочь нашим инженерным исследованиям.

source: Knowledge about these machines created might help our engineering research.
ru: Знания об этих созданных машинах могут помочь нашим инженерным исследованиям.

source: Knowledge about this software might help our physics research.
ru: Знания об этом программном обеспечении могут помочь нашим исследованиям в области физики.

source: Koch
ru: Кох

source: Kondrals Singularity
ru: Сингулярность Кондралса

source: Konrad
ru: Конрад

source: Kool Aid Enrichment Performed
ru: Выполнено обогащение Хладо-геном

source: Kool-Aid Vats
ru: Хладо-генные фабрики клонирования

source: Kotzil
ru: Котзил

source: Krause
ru: Краузе

source: Kronk Legions
ru: Легионы Кронка

source: Kronk Task Force
ru: Оперативная группа Кронка

source: Ktisma Construction
ru: Строительство Ктисмы

source: Ktisma Insula
ru: Ктисма Инсула

source: Ktisma Insula Drone
ru: Дрон Ктисма Инсула

source: Ktisma Insula Drones
ru: Дроны Ктисма Инсула

source: Ktisma Insula Management Cluster
ru: Кластер управления Ктисма Инсула

source: Ktisma Insula Management Clusters
ru: Кластеры управления Ктисма Инсула

source: Ktisma Insula Manager
ru: Менеджер Ктисма Инсула

source: Ktisma Insula Managers
ru: Менеджеры Ктисма Инсула

source: Ktisma Insula Worker
ru: Работник Ктисма Инсула

source: Ktisma Insula Workers
ru: Работники Ктисма Инсула

source: Ktisma Insulae
ru: Ктисма Инсулае

source: Kugelblitz Containment Silo
ru: Защитная шахта Кугельблитца

source: Kugelblitz Containment Silo Management Protocols
ru: Протоколы управления защитными бункерами Kugelblitz

source: Kugelblitz Generated!
ru: Создан Кугельблиц!

source: Kugelblitz Refined!
ru: Утонченный Кугельблиц!

source: Kuvis Maw
ru: Пасть Кувиса

source: Lab Exploration
ru: Лабораторное исследование

source: Lab Raided
ru: Обыск в лаборатории

source: Laboratory Facilities
ru: Лабораторные помещения

source: Laboratory Offensive Response Units
ru: Лабораторные подразделения наступательного реагирования

source: Laer Maelstrom
ru: Лаэр Водоворот

source: Lalds Maw
ru: Лалдс Мау

source: Land Clearance
ru: Расчистка территории

source: Land Grab
ru: Территориальный захват

source: Lang
ru: Лэнг

source: Lange
ru: Ланге

source: Lanoloy Vortex
ru: Вихрь Ланолоя

source: Lanypsos Singularity
ru: Сингулярность Ланипсоса

source: Large $tech_living_metal_armor$
ru: Большой $tech_living_metal_armor$

source: Large 'flat' plains of clouds, with strong winds.
ru: Большие "плоские" равнины облаков с сильными ветрами.

source: Large Advanced Perimeter Station Reactor
ru: Большой усовершенствованный реактор станции периметра

source: Large Conversion
ru: Значительное преобразование

source: Large Food Conversion
ru: Значительное преобразование пищи

source: Large Quberine-Laced Neutronium Armor
ru: Большая нейтрониевая броня, пропитанная куберином

source: Large chunks of the Planetary Computing Complex's databanks are filled with dangerous bloatware code, actively impeding our scientific efforts on this planet.
ru: Большие блоки банков данных Планетарного вычислительного комплекса заполнены опасным вредоносным кодом, активно препятствующим нашим научным усилиям на этой планете.

source: Large drifting clouds of precious Zro particles, floating endlessly.
ru: Большие дрейфующие облака драгоценных частиц Зро, плавающие бесконечно.

source: Large herds of airborne organisms drifting through the atmosphere.
ru: Большие стада организмов, находящихся в воздухе, дрейфующих в атмосфере.

source: Large portions of the planet's huge processing arrays are currently unreachable from our research facilities due to damaged connections between computational subsections.
ru: Большие части огромных вычислительных массивов планеты в настоящее время недоступны из наших исследовательских центров из-за поврежденных соединений между вычислительными подразделами.

source: Large scale collection of surface material will provide ample resources.
ru: Крупномасштабный сбор поверхностного материала обеспечит достаточные ресурсы

source: Large swathes of Flusion have fallen into complete anarchy as a result of collateral damage from the devastating fighting to dislodge the Kaiser from the planet.
ru: Большие территории Флюсиаллаа впали в полную анархию в результате сопутствующего ущерба от разрушительных боев за изгнание кайзера с планеты.

source: Large-Scale Bioatmospheric Modification
ru: Крупномасштабная биоатмосферная модификация

source: Laser Conduction Energy Distributor
ru: Распределитель энергии лазерной проводимости

source: Laser Crystal Bore
ru: Отверстие для лазерного кристалла

source: Laser weapons fire focused beams of light at targets, causing damage through the generation of intense heat.
ru: Лазерное оружие поражает цели фокусированными пучками света, причиняя урон за счет нагрева до очень высокой температуры.

source: Lasers
ru: Лазеры

source: Launch Pre-Emptive Strike Against Aeternum
ru: Нанести упреждающий удар по Этернуму

source: Laura
ru: Лаура

source: Laurandar has already been supported.
ru: Лорандар уже получил поддержку.

source: Laurnaise Gruntites
ru: Лорнез Грунтитес

source: Laurnaise Navy
ru: Лорнезский военно-морской флот

source: Lava Citadel
ru: Цитадель лавы

source: Lava Fortress
ru: Лавовая крепость

source: Lava Fortresses
ru: Глубокая крепость

source: Leader Cloned
ru: Лидер клонирован

source: Leader Cloning Selection
ru: Выбор клонирования лидеров

source: Leader Resurrection
ru: Воскрешение лидера

source: Leader Upload Selection
ru: Выбор загрузки лидера

source: Leader Uploaded
ru: Лидер загружен

source: Leaders Undertake Mass Protests!
ru: Лидеры проводят массовые протесты!

source: Leadership Upload
ru: Передача лидерства

source: Learn, Unlearn, and Relearn
ru: Учиться, учиться и еще раз учиться

source: Leased Robotic Armies
ru: Частные роботизированные армии.

source: Leased Robotic Assault Army
ru: Частная штурмовая армия роботов

source: Leased Slave Armies
ru: Частные армии рабов.

source: Leased Slave Army
ru: Частная рабская армия

source: Leave it be.
ru: Оставь это как есть.

source: Leave no stone unturned.
ru: Не оставляй камня на камне

source: Leave the System Alone
ru: Оставьте эту систему в покое

source: Leave the station
ru: Покиньте станцию

source: Leave.
ru: Улететь оттуда.

source: Leerekatzenbomber
ru: ЛиреКатзенбомбер

source: Leerekatzenbombers
ru: ЛиреКатзенбомберы

source: Legacy
ru: Наследие

source: Legacy Code Refurbishing Protocol in Effect
ru: Протокол восстановления исходного кода в действии

source: Legacy Code Refurbishing Protocol.
ru: Протокол восстановления исходного кода.

source: Legal Perfection
ru: Правовая культура

source: Legendary Forge
ru: Легендарная кузница

source: Legendary Forge World
ru: Легендарный кузнечный мир

source: Legions of administrative staff toil away to meet the growing expectations of an expanding bureaucracy.
ru: Легионы административного персонала усердно трудятся, чтобы соответствовать растущим ожиданиям расширяющейся бюрократии

source: Legions of autonomous psisynths armed with Loop-Quantum weaponry.
ru: Легионы автономных психосинтезов, вооруженных петлево-квантовым оружием.

source: Leisure Hypersegment
ru: Гиперсегмент досуга

source: Leisure Hypersegments
ru: Гиперсегменты досуга

source: Leisure Segment
ru: Сегмент досуга

source: Leisure Segments
ru: Сегменты досуга

source: Leolin
ru: Леолин

source: Leonore
ru: Леонора

source: Leopoldine
ru: Леопольдина

source: Leors
ru: Леоры

source: Lessons of the Past
ru: Уроки прошлого

source: Let everyone use it freely if they so desire.
ru: Пусть каждый пользуется им свободно, если он того желает.

source: Let him continue with his research.
ru: Пусть он продолжает свои исследования.

source: Let the cloning begin.
ru: Пусть начнется клонирование.

source: Let the flame consume our mind.
ru: Пусть пламя поглотит наш разум.

source: Let the plants be plants.
ru: Пусть растения будут растениями.

source: Let them come, then!
ru: Тогда пусть они придут!

source: Let this world shatter beneath our might if that is what they wish.
ru: Пусть этот мир рухнет под нашей мощью, если они этого хотят

source: Let us analyse these debris at once.
ru: Давайте немедленно проанализируем эти обломки.

source: Let us attempt to establish contact with them.
ru: Давайте попытаемся установить с ними контакт.

source: Let us begin.
ru: Давайте начнем

source: Let us finish this once and for all.
ru: Давайте покончим с этим раз и навсегда.

source: Let us focus all resources to build an empire that will last.
ru: Давайте направим все ресурсы на создание империи, которая будет существовать долго.

source: Let us get on it at once.
ru: Давайте займемся этим немедленно.

source: Let us get on it!
ru: Давайте займемся этим!

source: Let us get on it.
ru: Давайте займемся этим.

source: Let us get to it at once.
ru: Давайте перейдем к этому сразу

source: Let us get to it, then.
ru: Тогда давайте перейдем к делу

source: Let us hope our fleets and defences will suffice.
ru: Давайте надеяться, что наших флотов и средств обороны будет достаточно.

source: Let us hope this was a good decision.
ru: Давайте надеяться, что это было хорошее решение.

source: Let us not be hasty.
ru: Давайте не будем торопиться.

source: Let us not waste time!
ru: Давайте не будем терять время!

source: Let us proceed!
ru: Давайте продолжим!

source: Let us proceed.
ru: Давайте продолжим.

source: Let us proceed...
ru: Давайте продолжим...

source: Let us restore it at once!
ru: Давайте немедленно восстановим его!

source: Let us see what they decide.
ru: Давайте посмотрим, что они решат.

source: Let us, without restriction, use all food available to grow no structures and ships for our civilization.
ru: Давайте, без ограничений, использовать всю имеющуюся пищу на постройку сооружений и кораблей для нашей цивилизации.

source: Let your plans be dark and impenetrable as night, and when you move, fall like a thunderbolt.
ru: Пусть ваши планы будут темны, как ночь, а ваши действия, как удар молнии.

source: Let's Begin!
ru: Начнем!

source: Let's Begin.
ru: Начнем.

source: Let's begin.
ru: Давайте начнем.

source: Let's buy some armies.
ru: Давайте купим несколько армий.

source: Let's buy some robots.
ru: Давайте купим несколько роботов.

source: Let's buy some ships.
ru: Давайте купим несколько кораблей.

source: Let's buy some slaves.
ru: Давайте купим рабов.

source: Let's do it
ru: Давай сделаем это

source: Let's do it again.
ru: Давайте сделаем это снова.

source: Let's get on it at once!
ru: Давайте займемся этим немедленно!

source: Let's get on it at once.
ru: Давайте займемся этим немедленно.

source: Let's get to it at once!
ru: Давайте приступим к делу немедленно!

source: Let's get to it, then.
ru: Тогда давайте приступим к этому.

source: Let's hope nothing bad happens.
ru: Будем надеяться, что ничего плохого не случится.

source: Let's hunt some pirates.
ru: Давайте поохотимся на пиратов.

source: Let's make a deal.
ru: Давайте заключим сделку.

source: Let's make another step.
ru: Давайте сделаем еще один шаг.

source: Let's recruit a big group.
ru: Давайте наберем большую группу.

source: Let's recruit a medium sized group.
ru: Давайте наберем среднюю группу.

source: Let's recruit a small group.
ru: Давайте наберем небольшую группу.

source: Let's see about that.
ru: Давайте посмотрим.

source: Let's see how long he'll last...
ru: Давайте посмотрим, как долго он продержится...

source: Let's see how ready they are, shall we?
ru: Давайте посмотрим, насколько они готовы, не так ли?

source: Let's see if we can't bring it back online
ru: Давайте посмотрим, сможем ли мы вернуть его обратно в Сеть

source: Let's see what happens now...
ru: Давайте посмотрим, что теперь произойдет...

source: Let's see what they have.
ru: Посмотрим, что у них есть.

source: Let's sell them our resources.
ru: Давайте продадим им наши ресурсы.

source: Let's share his knowledge with us.
ru: Поделится с нами своими знаниями.

source: Let's use her breeding abilities.
ru: Давайте используем ее способности к размножению.

source: Let's use his botanical knowledge.
ru: Используем его особые растения.

source: Let's utilize those excess capacities now!
ru: Давайте используем ее сейчас.
